---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipeInsulationThickness
source: html/9ab0a824-d516-47b9-18f1-87d644a4d9f6.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipeInsulationThickness Property

Pipe Insulation Thickness, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipeInsulationThickness { get; }
```